Revit 2026 API

# BendingDetailAngularDimensionsDisplayOptions Enumeration

---

Describes the angular dimensions display options.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum BendingDetailAngularDimensionsDisplayOptions
```
```vb
Public Enumeration BendingDetailAngularDimensionsDisplayOptions
```
```cpp
public enum class BendingDetailAngularDimensionsDisplayOptions
```
```fsharp
type BendingDetailAngularDimensionsDisplayOptions
```

| Member name | Value | Description |
| --- | --- | --- |
| AllAngles | 0 | Display for all angle values. |
| Exclude90Degrees | 1 | Display for all angle values except the 90 degree. |

#### Reference

Autodesk.Revit.DB.Structure Namespace